app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def edit
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 3 LIMIT 1

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "supervisor_id", "first_name", "last_name", "hire_date", "termination_date", "is_supervisor", "is_administrator") VALUES ('matthew.c.heering01@gmail.com', '$2a$12$cWchVnKYJOk/jl7M3M05o.XrAZPs6cmzM8DGDWj09vae6bdpxWZIS', NULL, NULL, NULL, '2025-06-14 16:06:22.459522', '2025-06-14 16:06:22.459522', NULL, 'Matthew', 'Heering', '2025-06-14', NULL, TRUE, FALSE) RETURNING "id"

  def update
    if params[:employee][:password].blank?
      params[:employee].delete(:password)
      params[:employee].delete(:password_confirmation)
    end

    respond_to do |format|
      if @employee.update(employee_params)
---
DELETE FROM "employees" WHERE "employees"."id" = 8
UPDATE "employees" SET "email" = 'palma@gmail.example', "updated_at" = '2025-06-16 16:38:49.546651' WHERE "employees"."id" = 3

    def set_employee
      @employee = Employee.find_by(id: params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = NULL LIMIT 1