app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."is_supervisor" = TRUE
---
  def new
    @employee = Employee.new
    @supervisors = Employee.where(is_supervisor: true).map { |s| { id: s.id, name: "#{s.first_name} #{s.last_name}" } }

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 8 LIMIT 1
SELECT "employees".* FROM "employees" WHERE "employees"."is_supervisor" = TRUE
---
  def edit
    @employee = Employee.find(params[:id])
    @supervisors = Employee.where(is_supervisor: true).map { |s| { id: s.id, name: "#{s.first_name} #{s.last_name}" } }

DELETE FROM "employees" WHERE "employees"."id" = 8
---
  def destroy
    @employee = Employee.find_by(id: params[:id])
    if @employee
      @employee.destroy