app/controllers/fiscal_years_controller.rb

  def create
    fiscal_year = FiscalYear.new(fiscal_year_params)
    if fiscal_year.save
---
INSERT INTO "fiscal_years" ("start_date", "end_date", "created_at", "updated_at") VALUES ('2025-06-15', '2026-06-14', '2025-06-15 21:02:43.238811', '2025-06-15 21:02:43.238811') RETURNING "id"

  def update
    fiscal_year = FiscalYear.find(params[:id])
    if fiscal_year.update(fiscal_year_params)
---
SELECT "fiscal_years".* FROM "fiscal_years" WHERE "fiscal_years"."id" = 1 LIMIT 1
UPDATE "fiscal_years" SET "start_date" = '2024-06-01', "end_date" = '2025-05-31', "updated_at" = '2025-06-15 21:03:31.312317' WHERE "fiscal_years"."id" = 1