app/controllers/supervisors_controller.rb

SELECT "employees".* FROM "employees"
---
  def index
    @supervisor       = current_employee
    @employees = Employee.where(supervisor_id: current_employee.id)
    @time_off_requests = TimeOffRequest.where(supervisor_id: params[:id])
    @status_options  = [
      ["All", ""],
      ["Waiting for information", "waiting_information"],
      ["Decided", "decided"],
      ["Pending", "pending"]
    ]

    # Pull out the filter params (or nil)
    @selected_fy     = params[:fiscal_year_id].presence
    @selected_status = params[:status].presence

    # Base scope
    requests = TimeOffRequest.where(supervisor_id: @supervisor.id)

    # Filter by fiscal year if given
    if @selected_fy
      requests = requests.joins(:fiscal_year_employee)
                         .where(fiscal_year_employees: { fiscal_year_id: @selected_fy })
    end

    # In-Ruby filter by the status method
    @time_off_requests =
      if @selected_status
        requests.select { |r| r.status.to_s == @selected_status }