app/models/employee.rb

  def supervisor_name
    supervisor = Employee.find_by(id: supervisor_id)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IS NULL LIMIT 1